___

<a href='http://www.pieriandata.com'> <img src='../Pierian_Data_Logo.png' /></a>
___

# Operations

There are lots of operations with pandas that will be really useful to you, but don't fall into any distinct category. Let's show them here in this lecture:

In [1]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### Info on Unique Values

In [53]:
# "444" is repeated

df['col2'].unique()

# this will return a numpy array of all the unique values in column 2

array([444, 555, 666])

In [2]:
# what if you just wanted the number of unique values?

len(df['col2'].unique())

3

In [54]:
# pandas has a built in method for this which is ".nunique()"

df['col2'].nunique()

3

In [3]:
# to count the unique value and how many times it shows up
# this sounds kind of contradictory because why would they be unique if it shows up more than once, but if the counter is "1", 
# it means it is true unique

df['col2'].value_counts()

# "444" appeared twice so therefore, it's 2

444    2
555    1
666    1
Name: col2, dtype: int64

In [6]:
# you can't pass in more than 1 column at a time

df['col1', 'col2'].nunique()

KeyError: ('col1', 'col2')

#### Selecting Data

Select from DataFrame using criteria from multiple columns

In [7]:
# conditional selection
# for multiple conditions, you can wrap the conditions in parantheses and use ampersand or pipe operator (if you want "or")

newdf = df[(df['col1']>2) & (df['col2']==444)]

newdf

   col1  col2 col3
3     4   444  xyz

In [8]:
# just know, something like this:

df['col1']>2 

# is just a boolean series

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

### Applying Functions (Method)

You can use this method to invoke custom functions on your dataframes

This is usually really powerful for lambda functions

In [12]:
# repeating df for the visual sake

df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [11]:
df['col1'].sum()

# it adds all the values in "col1" together

10

In [9]:
# does .apply method happen inplace? 

# define the function 

def times2(x):
    return x*2

In [10]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [13]:
# this is what the values are in "col3"

df['col3']

0    abc
1    def
2    ghi
3    xyz
Name: col3, dtype: object

In [14]:
# what if we wanted the length of these strings in "col3"?

df['col3'].apply(len)

# "len" is highlighted because it was not a custom function but something already built into pandas

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [16]:
# ".apply" is usually powerful with lambda expressions because you don't have to take the whole time to define entire functions
# if you're going to just apply it once

df['col3'].apply(lambda x: x*2)

# it doubles the original string in 'col3'

0    abcabc
1    defdef
2    ghighi
3    xyzxyz
Name: col3, dtype: object

In [17]:
df['col3'] 

# it doesn't happen in place, so in order to save what was applied, it must be assigned to a variable

0    abc
1    def
2    ghi
3    xyz
Name: col3, dtype: object

** Permanently Removing a Column**

In [19]:
df.columns

# lists out columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [ ]:
# normally to drop, we'd have to do something along the lines of:

df.drop('col1', axis=1, inplace=True)

# this would happen in place

In [62]:
# or you can use the del built in function

del df['col1']

In [63]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

** Get column and index names: **

In [64]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [65]:
df.index

RangeIndex(start=0, stop=4, step=1)

** Sorting and Ordering a DataFrame:**

In [66]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [67]:
# you can sort by rows or columns, but you need to specify in the "by= "

df.sort_values(by='col2') #inplace=False by default

# notice how the index stays attached to the row, you don't ever lose that information there

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

** Find Null Values or Check for Null Values**

In [68]:
df.isnull()

# return a data table of booleans of if they are true or false

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [69]:
# Drop rows with NaN Values
df.dropna()

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

** Filling in NaN values with something else: **

In [71]:
import numpy as np

In [72]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [75]:
df.fillna('FILL')

   col1  col2 col3
0     1  FILL  abc
1     2   555  def
2     3   666  ghi
3  FILL   444  xyz

### Pivot Tables Method

.pivot_tables() creates a multi-index dataframe 
- useful for advanced excel users

In [20]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [21]:
# ".pivot_tables" takes in 3 main arguments: the values, the index, and the columns

df.pivot_table(values='D',index=['A', 'B'],columns=['C'])

# "values='D'" is taking values from the "D"-column and set the index equal to "A" and "B" column making "A" and "B" into a 
# multilevel index and want the actual columns to be defined by the "C"-column

# see how it rearranged all the data in the dataframe above?

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Great Job!